<template>
<div>
    <h3>Описание тестового задания</h3>
    <p>&#10003;	Создайте таблицу и кнопку, вызывающую модальное окно с формой.</p>
    <p>&#10003;	Сохраняйте данные из формы в таблицу.</p>
    <p>&#10003;	Данные должны сохраняться в LocalStorage при обновлении страницы.</p>
    <p>&#10003;	Добавьте в форму select с выбором родителя (любого из уже сохранённых пользователей). Добавьте в таблицу поддержку вложенных уровней.</p>
    <p>&#10003;	Добавьте сортировку данных в таблице по клику на заголовок колонки.</p>
    <p>&#10003;	Выложите выполненное задание на GitHub Pages.</p>
</div>
</template>

<script>
export default {
    name: 'About'
}
</script>
